Tekla.Structures.Model.EdgeChamfer.ChamferEndTypeEnum
The end type of the edge chamfer.

Tekla.Structures.Model.EdgeChamfer.ChamferEndTypeEnum.FULL
The chamfer continues to the end of the edge.

Tekla.Structures.Model.EdgeChamfer.ChamferEndTypeEnum.STRAIGHT
The chamfer end is straight at the given point.

Tekla.Structures.Model.EdgeChamfer.ChamferEndTypeEnum.BEVELLED
The chamfer end is bevelled at the given point.